/**
  ******************************************************************************
  * @file	 	fft.h
  * @author  	Neil Lab :: Left Radio
  * @version 	v1.0.0
  * @date
  * @brief		header
  ******************************************************************************
**/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FFT_H
#define __FFT_H

/* Includes ------------------------------------------------------------------*/
/* Exported define -----------------------------------------------------------*/
#define NS_P				7    /* показатель двойки (например, для БПФ на 256 точек это 8) */

/* Exported macro ------------------------------------------------------------*/
/* Exported typedef ----------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported function ---------------------------------------------------------*/
void fft_realMag_uint8_calc(uint8_t *In, uint8_t *Out, const float* coeffs);
void fft_realMag_int16_calc(int16_t *In, int16_t *Out, const float* coeffs);
void fft_realMag_float_calc(float *In, float *Out, const float* coeffs);





#endif /* __FFT_H */
/*********************************************************************************************************
      END FILE
*********************************************************************************************************/
